Repository: ahmeedmoheey/todo_collage_project
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Add new task
ar: اضافة مهمة جديدة

# weakPasswordMessage
source: The password provided is too weak.
ar: كلمة المرةر ضعيفة جدا.

# wrongEmailOrPasswordMessage
source: Wrong email or password
ar: خطأ في الايميل او كلمة المرور

# fullName
source: enter your full name
ar: ادخل اسمك بالكامل

# userName
source: enter your user name
ar: ادخل اسم المستخدم

# email
source: enter your email address
ar: ادخل الايميل الالكتروني

# password
source: enter your password
ar: ادخل كلمة المرور الخاص بك

# passwordConfirmation
source: Confirm password
ar: تأكيد الباسورد

source: weak-password
ar: كلمة المرور ضعيفة

# emailInUse
source: email-already-in-use
ar: الايميل موجود بالفعل!

source: invalid-credential
ar: بيانات اعتماد غير صالحة

# emailInUseMessage
source: The account already exists for that email.
ar: الحساب موجود بالفعل لهذا البريد الإلكتروني.

source: ToDoList
ar: قائمة المهمات

source: Settings
ar: الاعدادات

source: Tasks
ar: المهمات

source: Theme
ar: الثيمات

source: Language
ar: اللغة

# lightMode
source: Light
ar: فاتح

# darkMode
source: Dark
ar: داكن

# arabicApp
source: Arabic
ar: العربية

# enterTaskTitle
source: Plz, enter task title
ar: من فضلك ادخل العنوان

# enterDescriptionTask
source: enter your task title
ar: ادخل تفاصيل المهمه

# plzEnterYourEmail
source: Plz enter email
ar: من فضلك ادخل الايميل الخاص بك

# notHaveAcc
source: Donâ€™t have an account? Create Account
ar: ليس لديك حساب؟ قم بإنشاء حساب

source: Sign-In
ar: تسجيل الدخول

# userLoggedInSuccess
source: User Logged in successfully
ar: تم تسجيل دخول المستخدم بنجاح

source: OK
ar: تم التأكيد

source: Error
ar: خطأ

source: Try again
ar: حاول مرة اخري

# anErrorPlzTryAgain
source: An error occurred. Please try again
ar: حدث خطأ. يرجى المحاولة مرة أخرى

source: Waiting...!
ar: انتظار...!

source: Sign-Up
ar: انشاء حساب

source: alreadyHaveAnAccount
ar: بالتأكيد امتلك حساب

source: Email bad format
ar: البريد الالكتروني غير منسق

# passNotMatch
source: Password doesn't match
ar: كلمة المرور غير متطابقة

source: Plz, enter task title
ar: من فضلك ادخل عنوان المهمة

# plzEnterYourDescription
source: Plz, enter description
ar: من فضلك ادخل تفاصيل المهمة

# sorryDescription
source: Sorry, description should be at least 6 chars
ar: عذرا، الوصف يجب أن يكون على الأقل 6 أحرف

source: Select date
ar: حدد التاريخ

source: Add task
ar: إضافة مهمة

source: enter timeout
ar: أدخل مهلة زمنية

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Save Changes
ar: حفظ التغيرات
